{
  "backend/main.mo": "Main backend canister managing user profiles with access control, Bible stories, verses, and admin‑restricted image uploads.",
  "feature_evidence.json": "Metadata describing feature evidence for deployment functionality and associated files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for quick reference during build planning.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for building and publishing the app to the Internet Computer.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, themes, and base layout styles for light and dark modes.",
  "frontend/index.html": "Frontend HTML entry point loading the React app and linking generated favicon assets.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes and wraps pages in a shared layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting first‑time authenticated users to save their display name with validation and async submission.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level layout with header navigation, authentication UI, profile dialog, and footer surrounding all pages.",
  "frontend/src/components/story/ImageUploadSection.tsx": "UI component for admins to upload or replace story or verse images with validation and progress tracking.",
  "frontend/src/components/story/PublicImage.tsx": "Renders an ExternalBlob image URL and shows an error fallback if loading fails.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, stories, verses, admin status, and image uploads.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme colors, typography, and utility classes for app styling.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/DailyVersePage.tsx": "Page that displays the daily verse with loading, error handling, and a refresh option.",
  "frontend/src/pages/HomePage.tsx": "Home page listing navigation cards linking to daily verses, stories, and testament pages.",
  "frontend/src/pages/StoriesPage.tsx": "Loads and displays a list of stories with loading and error states, allowing navigation to individual story detail pages.",
  "frontend/src/pages/StoryDetailPage.tsx": "Shows detailed information for a specific story, including image upload and verses, with loading and error handling.",
  "frontend/src/pages/TestamentPage.tsx": "Fetches and lists verses from a selected testament with navigation to verse detail pages and full loading/error states.",
  "frontend/src/pages/VerseDetailPage.tsx": "Displays detailed information for a specific verse, including optional image, with routing, loading, and error handling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins for the frontend styling system.",
  "project_state.json": "Stores project versioning, architectural notes, feature list, and project summary for a Bible verses website. Acts as the project's state definition including planned features, admin rules, and known issues."
}