{
  "backend/main.mo": "Motoko backend actor handling access control, user profiles, initial Bible stories, and storage hooks for verses and story images.",
  "feature_evidence.json": "Feature evidence listing UI authorization and admin‑status hook changes tied to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, components, hooks, and pages for the Bible verses app.",
  "frontend/index.css": "Base Tailwind CSS with OKLCH variables defining light/dark theme tokens and shared global styling.",
  "frontend/index.html": "HTML entry page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with site layout and all main routes such as home, stories, testament pages, and verse details.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter their display name and saving it via React Query.",
  "frontend/src/components/layout/SiteLayout.tsx": "Global layout with header navigation, login button, profile dialog, and footer wrapping routed content.",
  "frontend/src/components/story/ImageUploadSection.tsx": "React component for displaying current story or verse image and allowing admins to upload and replace images with validation and progress tracking.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and exposing identity and login status to the app.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, admin status, stories, verses, and uploading images through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining custom color themes, typography, and utility classes for verse and story styling.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity provider before rendering the main application.",
  "frontend/src/pages/DailyVersePage.tsx": "Page that displays the daily verse with loading, error handling, refresh capability, and styled layout.",
  "frontend/src/pages/HomePage.tsx": "Home page presenting navigation cards linking to daily verse, stories, and testament pages with styled icons and descriptions.",
  "frontend/src/pages/StoriesPage.tsx": "Displays a list of Bible stories with loading/error states and navigation to individual story pages.",
  "frontend/src/pages/StoryDetailPage.tsx": "Shows details for a selected story, including summary, image upload, and key verses.",
  "frontend/src/pages/TestamentPage.tsx": "Lists verses from the selected testament with loading/error handling and navigation to verse details.",
  "frontend/src/pages/VerseDetailPage.tsx": "Displays details for a single verse with navigation back and optional image rendering.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin setup for the project.",
  "project_state.json": "JSON describing the project’s current state, including version info, overall website summary, architectural notes, and a list of implemented features with IDs, titles, and requirement links."
}