{
  "backend/main.mo": "Main Motoko canister defining user profiles, access control, story and verse data structures, and initial story seed data.",
  "feature_evidence.json": "Empty feature evidence report containing a features array.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference or tooling.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining prerequisites and steps for publishing the app to the Internet Computer.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens defining light and dark theme variables.",
  "frontend/index.html": "HTML entry point with root mount point and favicon links referencing generated icons.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in the SiteLayout.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button using Internet Identity with login/logout and loading state handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new users to enter a display name and saving it via backend hooks.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top‑level layout with header navigation, footer, login button, and profile setup dialog.",
  "frontend/src/components/story/ImageUploadSection.tsx": "Admin-only image upload component that validates selected files, tracks upload progress, and replaces story or verse images via a mutation hook.",
  "frontend/src/components/story/PublicImage.tsx": "Displays an image from an ExternalBlob and shows a fallback error state if loading fails.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management for authentication.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, admin checks, stories, verses, daily verse, and image uploads.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and utility classes for typography and layout.",
  "frontend/src/main.tsx": "Application entry that initializes React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/DailyVersePage.tsx": "Page showing the daily verse with loading, error handling, and the ability to refresh the verse.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying navigation cards linking to daily verses, stories, and testament pages.",
  "frontend/src/pages/StoriesPage.tsx": "Displays a list of stories with loading and error states, allowing navigation to individual story detail pages.",
  "frontend/src/pages/StoryDetailPage.tsx": "Shows detailed information for a single story, including summary, verses, and image upload, with loading and error handling.",
  "frontend/src/pages/TestamentPage.tsx": "Fetches and displays verses from either the Old or New Testament with navigation to verse detail pages.",
  "frontend/src/pages/VerseDetailPage.tsx": "Renders detailed information for a specific verse, including text and optional image, with navigation back to its testament page.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings for the frontend UI.",
  "project_state.json": "Defines the project’s current version, feature set, architectural notes, and admin-only image upload rules for a Bible verse website. Includes existing features, known issues, and indicates this is a fix request."
}