{
  "backend/main.mo": "Defines user profiles, authorization checks, and Bible story/verse data with initial story seeds and image support via ExternalBlob.",
  "feature_evidence.json": "Describes a feature update affecting StoryDetailPage with related components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides high-level summaries of all frontend files including pages, components, hooks, styles, and deployment docs.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites and steps to publish the current draft build to production on the Internet Computer.",
  "frontend/index.css": "Global CSS defining OKLCH-based theme variables, light/dark mode palettes, and base Tailwind styling.",
  "frontend/index.html": "HTML entry point loading the React app with favicon links and mounting root container.",
  "frontend/PRODUCTION-RELEASE-CHECKLIST.md": "Comprehensive checklist for verifying, executing, and validating a production release, including rollback criteria.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps all pages in the shared SiteLayout component.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users for their display name and saving it via backend profile APIs.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides the main site layout with header navigation, footer, and profile/login elements.",
  "frontend/src/components/story/ImageUploadSection.tsx": "Handles image display and admin-only upload with validation, progress tracking, and error handling.",
  "frontend/src/components/story/PublicImage.tsx": "Displays an image from an ExternalBlob and shows a fallback UI if loading fails.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, managing login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for profiles, admin status, stories, verses, daily verse, and image uploads.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/pages/DailyVersePage.tsx": "Fetches and displays the daily verse with loading, error, and refresh UI states.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with navigation cards linking to daily verses, stories, and testaments.",
  "frontend/src/pages/StoriesPage.tsx": "Fetches and displays a list of Bible stories with loading and error states and navigates to story detail pages.",
  "frontend/src/pages/StoryDetailPage.tsx": "Shows detailed story content including image upload, scripture verses, and summary with navigation back to the stories list.",
  "frontend/src/pages/TestamentPage.tsx": "Displays verses for either the Old or New Testament with loading/error handling and navigation to verse detail pages.",
  "frontend/src/pages/VerseDetailPage.tsx": "Shows details for a single verse, including text and optional image, with navigation back to its testament list.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography/container/animation plugins, and extended theme settings for fonts, layout, and UI animations.",
  "project_state.json": "JSON snapshot describing the website’s current feature set, architecture notes, known issues, and project metadata for a Bible verse/story application."
}