{
  "backend/main.mo": "Main canister logic implementing access control, user profiles, Bible story and verse data structures, and initial story seed data.",
  "backend/migration.mo": "Defines a no-op migration function that returns the existing actor state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting a frontend image component fix with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of each frontend file.",
  "frontend/index.css": "Global Tailwind-based theme variables and styles defining color tokens, dark mode values, and base element styling.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon links, and mounts the React app root.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps all pages in the shared SiteLayout.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading and error recovery states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter their name and saving it via backend queries.",
  "frontend/src/components/layout/SiteLayout.tsx": "Overall site layout with header navigation, login button, profile dialog, content container, and footer.",
  "frontend/src/components/story/ImageUploadSection.tsx": "Component that displays the current story/verse image and lets admins upload and validate a new image with progress and error handling.",
  "frontend/src/components/story/PublicImage.tsx": "Wrapper component that loads an ExternalBlob image URL and shows a fallback UI if loading fails.",
  "frontend/src/hooks/useActor.ts": "Creates and retrieves a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and stored identity loading via a React context.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks wrapping backend calls for profiles, admin status, stories, verses, daily verse, and image uploads.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode colors, and typography/utility styles.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/DailyVersePage.tsx": "Page that fetches and displays the daily verse with loading, error, and manual refresh support.",
  "frontend/src/pages/HomePage.tsx": "Home page offering navigation cards linking to daily verses, stories, and testament pages.",
  "frontend/src/pages/StoriesPage.tsx": "Displays a list of Bible stories with loading and error states and navigates to individual story pages.",
  "frontend/src/pages/StoryDetailPage.tsx": "Shows detailed information for a specific story, including image upload and verse list.",
  "frontend/src/pages/TestamentPage.tsx": "Fetches and lists verses from either the Old or New Testament with navigation to verse detail pages.",
  "frontend/src/pages/VerseDetailPage.tsx": "Displays detailed information for a specific verse, including optional image and back navigation.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for retrieving, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme settings, color tokens, plugins, and container layout.",
  "project_state.json": "Defines the project’s current state, features, issues, and architectural notes for a Bible‑verse website, including admin‑only image uploads and a daily verse system. Marks an image‑loading bug as a fix request."
}