{
  "kind": "build_request",
  "title": "Restrict story/verse image uploads to a single site owner (admin-only)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Enforce backend authorization so that only the single admin (site owner) can upload or replace story/verse images; all other users (including signed-in non-admin users) must be rejected by the backend if they attempt to upload.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Only I can upload images please."
        ]
      },
      "acceptanceCriteria": [
        "When a non-admin caller invokes the image upload method, the call fails with an authorization error and no image data is modified.",
        "When the admin caller invokes the image upload method, the upload succeeds and the image is persisted/returned with stories/verses as before.",
        "Anonymous/guest users can still read stories/verses and view any existing images without errors."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Expose a backend query method that allows the frontend to determine whether the current caller is the admin (site owner), without granting upload capability by itself.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Only I can upload images please."
        ]
      },
      "acceptanceCriteria": [
        "A new query endpoint exists that returns a boolean indicating whether the caller is an admin.",
        "The query can be called by guests and authenticated users (no trap for anonymous callers).",
        "The value returned matches the same admin check used to gate image uploads."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update the image upload UI so that the upload controls are shown only for the admin user; non-admin users must not see the file picker/upload button. Non-admin users should still be able to view existing images.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Only I can upload images please."
        ]
      },
      "acceptanceCriteria": [
        "When logged out, the story page shows any existing story image but does not show any upload controls.",
        "When logged in as a non-admin, the story page shows any existing story image but does not show any upload controls.",
        "When logged in as the admin, the story page shows the upload controls and can successfully upload/replace images.",
        "User-facing text is in English and does not instruct non-admin users to upload images (e.g., remove/replace prompts like “Login to upload an image” for non-admin/guest views)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add frontend data access (React Query hook) to fetch the caller admin status from the backend and wire it into the image upload component(s) so authorization state updates correctly after login/logout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Only I can upload images please."
        ]
      },
      "acceptanceCriteria": [
        "A React Query hook exists to fetch admin status and is invalidated/refetched appropriately when identity changes (login/logout).",
        "The image upload component(s) use the fetched admin status (not just “is authenticated”) to determine whether to render upload controls.",
        "No changes are made to frontend immutable paths (Internet Identity and actor hooks), and the solution composes with existing hooks/components."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo (no new backend services).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Keep existing uploaded images visible to all users (admin-only restriction applies only to uploading/replacing)."
  ],
  "nonGoals": [
    "Implementing multi-admin roles or an admin management UI.",
    "Adding new content types beyond the existing story/verse image capability.",
    "Changing which stories/verses exist or how daily verses are selected."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}