{
  "kind": "build_request",
  "title": "Expand Stories content to KJV major Bible stories with narrative verses and summary at the bottom",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Update the backend Stories dataset so Stories use King James Version (KJV) text and include all major Bible stories, where each story contains only the verses that carry the narrative (i.e., the story text) rather than every verse in the surrounding chapters.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I think you should use the King James Version.",
          "All the major bible verses.",
          "Only the verses that contain the narrative."
        ]
      },
      "acceptanceCriteria": [
        "On a fresh install, `getStories()` returns a non-empty list representing major Bible stories (not just a small starter set).",
        "For each returned story, verse `text` is KJV wording (no modern paraphrase/NIV/ESV phrasing).",
        "For each story, the `verses` list contains narrative verses only (not \"all verses\" in long ranges, genealogies, or non-narrative sections) consistent with the user request.",
        "Existing Story fields (`title`, `summary`, `verses`, `image`) remain present and compatible with the current frontend."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Update the backend Daily Verse curated set so all daily verse texts are in King James Version (KJV) wording.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I think you should use the King James Version."
        ]
      },
      "acceptanceCriteria": [
        "`getDailyVerse()` always returns verses with KJV text (e.g., John 3:16 uses \"For God so loved the world, that he gave his only begotten Son...\").",
        "No Daily Verse entry contains non-KJV phrasing currently present in the curated list."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Update the Story detail UI to present the story as narrative verse text followed by a summary at the bottom (instead of showing the summary near the top and labeling verses as \"Key Verses\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Provide the actual story from the bible, then a summary at the bottom.",
          "Only the verses that contain the narrative."
        ]
      },
      "acceptanceCriteria": [
        "On the Story detail page, the verse list is presented as the story text (narrative verses) and is clearly readable as a continuous story experience.",
        "The story summary is displayed after the narrative verse text (at the bottom of the page content).",
        "Any user-facing heading/label that implies the verses are only \"Key Verses\" is removed or replaced with an English label that reflects narrative story text (e.g., \"Story\" / \"Scripture\" / \"Story Text\").",
        "Story image display/upload behavior remains unchanged (admin can upload/replace; non-admins can view only)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not modify files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or `frontend/src/components/ui` (compose existing components instead).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Do not implement a complete, fully comprehensive verse-by-verse Bible database covering every verse in the Bible.",
    "Do not add third-party Bible text API integrations or external databases.",
    "Do not change authentication approach (Internet Identity remains the only auth mechanism)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}